---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotDrawProfileRoof
source: html/19e1ed42-dbf9-c4f4-962a-02a85eae04c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotDrawProfileRoof Property

Can't make footprint roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawProfileRoof { get; }
```